void main() {
  task1();
  task2();
  task3();
  task4();
  task5();
  task6();
  task7();
  task8();
  task9();
  task10();
}

/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
  final a = 30.9;
  final b = 18.4;
  final area = a * b;
  print('Area - $area');
  final perimeter = (a + b) * 2;
  print('Perimeter - $perimeter');
  final x = area ~/ 1;
  print('Кількість квадратів - $x');
}

/// Завдання 2: Оператори порівняння
/// Створіть змінну number.
///
/// Перевірте:
/// Чи більше число за 50.
/// Чи менше число за 100.
/// Чи ділиться число на 5 без залишку.
/// Виведіть всі результати.
void task2() {
  final number = 75;
  final isGreater = number > 50;
  final isLess = number < 100;
  final isInteger = number % 5 == 0;
  print('Чи більше 50: $isGreater');
  print('Чи менше 100: $isLess');
  print('Чи ділиться на 5 без залишку: $isInteger');
}

/// Завдання 3: Логічні оператори
/// Створіть змінні hasMoney і isStoreOpen (типу bool).
///
/// Перевірте:
/// Чи можна зробити покупку (якщо є гроші і магазин відкритий).
/// Чи потрібно почекати (якщо магазин закритий або немає грошей).
/// Використайте оператори &&, ||, !.
void task3() {
  final hasMoney = true;
  final isStoreOpen = true;
  final canShop = hasMoney & isStoreOpen;
  final nextTime = !hasMoney || !isStoreOpen;
  print('Чи можу я зробити покупки? $canShop');
  print('Чи покупки зроблю наступного разу? $nextTime');
}

/// Завдання 4: Тернарний оператор
/// Створіть змінну temperature.
///
/// Використайте тернарний оператор, щоб визначити:
/// Якщо більше 25 — “Тепло”.
/// Якщо менше або дорівнює 25 — “Прохолодно”.
/// Потім створіть ще один тернарний оператор:
/// Якщо менше 10 — вивести “Дуже холодно”.

void task4() {
  final temperature = 30;
  temperature > 25 ? print('Тепло') : print('Прохолодно');
  temperature < 10 ? print('Дуже холодно') : print('Прохолодно');
}

/// Завдання 5: Оператори присвоєння
/// Використовувати тільки оператори присвоєння (+=, -=, *=, /=)
///
/// Створіть змінну score = 0.
/// Створіть зміни з даними:
/// correctAnswers = 17;
/// mistakes = 3;
/// totalQuestions = 20;
///
/// Додайте 10 балів за кожну правильну відповідь.
/// Відніміть 5 балів за кожну помилку.
///
/// Збільшіть загальну кількість балів у 2 рази.
/// Поділіть бали на кількість запитань.
/// Виведіть остаточний результат.

void task5() {
  var score = 0;
  var correctAnswers = 17;
  var mistakes = 3;
  final totalQuestions = 20;
  correctAnswers *= 10;
  mistakes *= 5;
  score += correctAnswers -= mistakes;
  score *= 2;
  score ~/= totalQuestions;
  print('Оцінка: $score');
}

/// Завдання 6: Умовні конструкції if/else
/// Створіть змінну examScore з значенням 56
/// Створіть умовні конструкції if / else if / else
/// Якщо більше 90 — вивести “Відмінно”.
///
/// Якщо 75–90 — “Добре”.
/// Якщо 60–74 — “Задовільно”.
/// Якщо менше 60 — “Не здано”.
///
/// Додатково: якщо оцінка менше 20 — вивести “Повторити курс”.
/// Поексперементуйте, змінюючи  значення examScore

void task6() {
  final examScore = 56;
  if (examScore > 90) {
    print('Відмінно');
  } else if (examScore >= 75) {
    print('Добре');
  } else if (examScore >= 60) {
    print('Задовільно');
  } else if (examScore >= 20) {
    print('Не здано');
  } else {
    print('Повторити курс');
  }
}

/// Завдання 7: Конструкція switch statement
/// Створіть змінну dayNumber від 1 до 7.
///
/// Використайте switch, щоб вивести:
/// Понеділок, Вівторок, …, Неділя.
/// Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
/// Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

void task7() {
  final dayNumber = 6;
  switch (dayNumber) {
    case 0:
      print('Невірний номер дня');
    case > 7:
      print('Невірний номер дня');
    case 1:
      print('Понеділок');
    case 2:
      print('Вівторок');
    case 3:
      print('Середа');
    case 4:
      print('Четвер');
    case 5:
      print("П'ятниця");
    case 6:
      print('Субота');
      print('Вихідний день 🎉');
    case 7:
      print('Неділя');
      print('Вихідний день 🎉');
  }
}

/// Завдання 8: Цикли for
/// Виведіть всі числа від 1 до 10.
/// Виведіть тільки парні числа.
/// Обчисліть суму чисел від 1 до 10.

void task8() {
  for (var i = 1; i <= 10; i++) {
    print('Число: $i');
  }
  for (var i = 1; i <= 10; i++) {
    if (i % 2 == 0) {
      print('Парне число: $i');
    }
  }
  var counter = 0;
  for (var i = 1; i <= 10; i++) {
    counter = counter + i;
  }
  print('Сума: $counter');
}

/// Завдання 9: Цикл while
/// Почніть із числа 10.
///
/// Виводьте числа, зменшуючи їх на 1, поки не досягнете 0.
/// Якщо число парне — вивести “Парне число: …”,
/// якщо непарне — “Непарне число: …”.

void task9() {
  var number = 10;
  do {
    if (number % 2 == 0) {
      print('Парне число: $number');
    } else {
      print('Непарне число: $number');
    }
    number--;
  } while (number >= 0);
}

/// Завдання 10: Break і Continue
/// Створіть цикл for від 1 до 20.
///
/// Якщо число ділиться на 3 без залишку — пропустіть його (continue).
/// Якщо число більше 15 — зупиніть цикл (break).
/// Виведіть тільки ті числа, які пройшли обидві перевірки.
void task10() {
  for (var i = 1; i <= 20; i++) {
    if (i % 3 == 0) continue;
    if (i > 15) break;
    print('Число: $i');
  }
}
